src/Documents/РасходТовара/РасходТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходТовара</name>
  <registerRecords>AccumulationRegister.ОстаткиНаСкладах</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ОстаткиНаСкладах/ОстаткиНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/РасходТовара/ObjectModule.bsl
#Область ОбработчикиСобытий

// Обработчик события ОбработкаПроведения.
// Использует стандартную новую методику проведения:
// 1. Проверяет заполнение документа.
// 2. Формирует расходные движения по регистру.
// 3. Устанавливает БлокироватьДляИзменения и записывает движения -
//    платформа сама устанавливает исключительную управляемую блокировку
//    по всем комбинациям измерений записываемого набора.
// 4. После записи проверяет, не появились ли отрицательные остатки.
//    При обнаружении - отменяет проведение, движения откатываются
//    вместе с транзакцией.
//
// Параметры:
//  Отказ          - Булево - признак отказа от проведения.
//  РежимПроведения - РежимПроведенияДокумента - текущий режим проведения.
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если НЕ ПроверитьЗаполнениеДокумента(Отказ) Тогда
		Возврат;
	КонецЕсли;

	СформироватьДвижения();

	Движения.ОстаткиНаСкладах.БлокироватьДляИзменения = Истина;
	Движения.ОстаткиНаСкладах.Записать();

	ПроверитьОстаткиПослеПроведения(Отказ);

КонецПроцедуры

// Обработчик события ОбработкаУдаленияПроведения.
// Удаляет движения документа по регистру накопления ОстаткиНаСкладах.
//
// Параметры:
//  Отказ - Булево - признак отказа от отмены проведения.
Процедура ОбработкаУдаленияПроведения(Отказ)

	Движения.ОстаткиНаСкладах.Очистить();
	Движения.ОстаткиНаСкладах.Записать();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Формирует сообщение пользователю и привязывает его к реквизиту документа.
//
// Параметры:
//  ТекстСообщения - Строка - текст сообщения.
//  Поле           - Строка - имя реквизита шапки или путь к реквизиту табличной части.
Процедура СообщитьПользователю(ТекстСообщения, Поле = "")

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Поле  = Поле;
	Сообщение.УстановитьДанные(ЭтотОбъект);
	Сообщение.Сообщить();

КонецПроцедуры

// Проверяет заполнение реквизитов шапки и табличной части документа.
// При обнаружении ошибок отменяет проведение и выводит поясняющие сообщения.
//
// Параметры:
//  Отказ - Булево - признак отмены проведения документа.
//
// Возвращаемое значение:
//  Булево - Истина, если документ заполнен корректно.
Функция ПроверитьЗаполнениеДокумента(Отказ)

	ВсеКорректно = Истина;

	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		СообщитьПользователю("Не указан склад расхода.", "Склад");
		ВсеКорректно = Ложь;
	КонецЕсли;

	Если Товары.Количество() = 0 Тогда
		СообщитьПользователю("Табличная часть ""Товары"" не заполнена.", "Товары");
		ВсеКорректно = Ложь;
	КонецЕсли;

	Для Индекс = 0 По Товары.Количество() - 1 Цикл

		СтрокаТЧ = Товары[Индекс];

		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
			СообщитьПользователю(
				"В строке " + Строка(Индекс + 1) + " не выбрана номенклатура.",
				"Товары[" + Строка(Индекс) + "].Номенклатура");
			ВсеКорректно = Ложь;
		КонецЕсли;

		Если СтрокаТЧ.Количество <= 0 Тогда
			СообщитьПользователю(
				"В строке " + Строка(Индекс + 1) + " количество должно быть больше нуля.",
				"Товары[" + Строка(Индекс) + "].Количество");
			ВсеКорректно = Ложь;
		КонецЕсли;

	КонецЦикла;

	Если НЕ ВсеКорректно Тогда
		Отказ = Истина;
	КонецЕсли;

	Возврат ВсеКорректно;

КонецФункции

// Формирует расходные движения по регистру накопления ОстаткиНаСкладах
// по строкам табличной части документа. Запись не выполняется -
// будет выполнена позже с установкой БлокироватьДляИзменения.
Процедура СформироватьДвижения()

	Движения.ОстаткиНаСкладах.Очистить();

	Для Каждого СтрокаТЧ Из Товары Цикл

		Запись = Движения.ОстаткиНаСкладах.ДобавитьРасход();
		Запись.Период       = Дата;
		Запись.Номенклатура = СтрокаТЧ.Номенклатура;
		Запись.Склад        = Склад;
		Запись.Количество   = СтрокаТЧ.Количество;

	КонецЦикла;

КонецПроцедуры

// Проверяет остатки регистра после записи движений документа.
// Граница "МоментВремени() включая" обеспечивает учет движений
// текущего документа в расчете итогов.
// При обнаружении отрицательных остатков отменяет проведение -
// транзакция откатывается целиком, документ остается без движений.
//
// Параметры:
//  Отказ - Булево - признак отмены проведения документа.
Процедура ПроверитьОстаткиПослеПроведения(Отказ)

	Требования = Новый Соответствие;
	СписокНоменклатуры = Новый Массив;

	Для Каждого СтрокаТЧ Из Товары Цикл

		ТекущееТребование = Требования[СтрокаТЧ.Номенклатура];
		Если ТекущееТребование = Неопределено Тогда
			Требования.Вставить(СтрокаТЧ.Номенклатура, СтрокаТЧ.Количество);
		Иначе
			Требования.Вставить(СтрокаТЧ.Номенклатура, ТекущееТребование + СтрокаТЧ.Количество);
		КонецЕсли;

	КонецЦикла;

	Для Каждого КлючЗначение Из Требования Цикл
		СписокНоменклатуры.Добавить(КлючЗначение.Ключ);
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Остатки.Номенклатура КАК Номенклатура,
		|	Остатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ОстаткиНаСкладах.Остатки(
		|			&Период,
		|			Склад = &Склад
		|				И Номенклатура В (&СписокНоменклатуры)) КАК Остатки
		|ГДЕ
		|	Остатки.КоличествоОстаток < 0";

	Запрос.УстановитьПараметр("Период", Новый Граница(МоментВремени(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		Номенклатура   = Выборка.Номенклатура;
		ОстатокПосле   = Выборка.Количество;
		Требуется      = Требования[Номенклатура];
		ДоступноДо     = Требуется + ОстатокПосле;

		СообщитьПользователю(
			"Недостаточно товара """ + Номенклатура + """. Требуется: "
				+ Требуется + ", доступно до проведения: " + ДоступноДо + ".");

		Отказ = Истина;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти
